Tekla Open API Reference for Tekla Structures 2025
Operation.GetHandlePoints Method
 Get the Shape Item Handle Points
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<Point> GetHandlePoints(
	string guid
)
Public Shared Function GetHandlePoints (
	guid As String
) As List(Of Point)
Parameters
guid
Type: System.String
The guid of the shape
Return Value
Type: List<Point>
List of Handle Points
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace